In [52]:
from selenium import webdriver
from selenium.webdriver.common.keys import Keys
from selenium.webdriver.common.by import By

import pandas as pd
from bs4 import BeautifulSoup
import sqlite3

In [2]:
browser=webdriver.Chrome()

In [3]:
browser.get('https://www.tripadvisor.in/Hotels-g186338-London_England-Hotels.html')

In [4]:
accept = browser.find_element(By.ID, "onetrust-accept-btn-handler")
accept.click()

In [6]:
soup = BeautifulSoup(browser.page_source, 'lxml')

In [45]:
list_of_numbers = str(list(range(1, 101)))
hotels = []
for name in soup.findAll('a',{'data-clicksource':'HotelName'}):
      hotels.append(name.text.strip(list_of_numbers + '.'))
hotels[:5]

['YOTEL London Shoreditch',
 'The Montcalm Royal London House',
 'Park Grand London Hyde Park',
 'The Resident Covent Garden',
 'Park Grand Paddington Court']

In [26]:
ratings = []
for rating in soup.findAll('a',{'class':'ui_bubble_rating'}):
      if rating['alt'] == "5 of 5 bubbles":
            rating = 10
      elif rating['alt'] == "4.5 of 5 bubbles":
            rating = 9
      elif rating['alt'] == "4 of 5 bubbles":
            rating = 8
      elif rating['alt'] == "3.5 of 5 bubbles":
            rating = 7
      elif rating['alt'] == "3 of 5 bubbles":
            rating = 6
      else:
            rating = 5
      ratings.append(rating)
len(ratings)

34

In [67]:
reviews = []
for review in soup.findAll('a',{'class':'review_count'}):
  reviews.append(review.text.replace('reviews','').replace(',','').strip())
len(reviews)

34

In [68]:
price = []
for p in soup.findAll('div',{'data-sizegroup':'mini-meta-price'}):
  price.append(p.text.replace('€','').replace(',','').strip()) 
price[:5]
len(price)

34

In [69]:
d1 = {'Hotel':hotels,'Ratings':ratings,'No_of_Reviews':reviews,'Price, €':price}
df = pd.DataFrame.from_dict(d1)

In [70]:
df

,Hotel,Ratings,No_of_Reviews,"Price, €"
0,YOTEL London Shoreditch,9,685,112
1,The Montcalm Royal London House,10,3356,207
2,Park Grand London Hyde Park,8,3362,159
3,The Resident Covent Garden,10,1243,302
4,Park Grand Paddington Court,9,3212,145
5,Travelodge London City hotel,9,2378,59
6,"The Biltmore Mayfair, LXR Hotels & Resorts",8,173,930
7,Canopy by Hilton London City,10,424,194
8,The Montcalm London Marble Arch,10,3812,473
9,Hard Rock Hotel London,9,2243,386
10,"The Clermont, Charing Cross",10,6724,385
11,The Tower Hotel,8,12242,156
12,Novotel London Tower Bridge,8,3709,175
13,Travelodge London Docklands Central,8,576,74
14,Leonardo Royal Hotel London St. Paul's,8,1457,214
15,Leonardo Royal London Tower Bridge,8,2147,178
16,Holiday Inn London - West,9,1281,99
17,Royal National Hotel,6,10766,217
18,Park Plaza Westminster Bridge London,9,23720,301
19,Travelodge London Central City Road,8,2198,65
20,The Montague on The Gardens,10,5449,347
21,"The Standard, London",9,495,306
22,Millennium Gloucester Hotel London Kensington,8,6715,143
23,The Resident Kensington,9,4753,200
24,Travelodge London Manor House,9,264,96
25,The Bailey's Hotel London Kensington,9,1923,233
26,The Clarendon,8,2944,154
27,Travelodge London Covent Garden,8,12307,91
28,Grand Royale London Hyde Park,8,5417,139
29,The President Hotel,7,4704,193
30,Premier Inn London Hendon (The Hyde) hotel,8,841,82
31,St. Athans Hotel,8,855,109
32,Novotel London West,8,5326,164
33,Mercure London Bridge,9,440,188

In [71]:
df.to_csv("tripadvisor_london_list.csv")

In [73]:
conn = sqlite3.connect('my_data.db')
c = conn.cursor()

In [74]:
tripadvisor = pd.read_csv('tripadvisor_london_list.csv')
tripadvisor.head()

,Unnamed: 0,Hotel,Ratings,No_of_Reviews,"Price, €"
0,0,YOTEL London Shoreditch,9,685,112
1,1,The Montcalm Royal London House,10,3356,207
2,2,Park Grand London Hyde Park,8,3362,159
3,3,The Resident Covent Garden,10,1243,302
4,4,Park Grand Paddington Court,9,3212,145

In [75]:
tripadvisor.to_sql('tripadvisor', conn, if_exists='append', index = False)

34

In [76]:
booking = pd.read_csv('bookingcom_london_list.csv')
booking.head()

,Unnamed: 0,Hotel,Ratings,No_of_Reviews,"Price, €"
0,0,One Hundred Shoreditch,8.6,1622,2422
1,1,Stunning New Development in Barking,7.1,25,771
2,2,"St. James' Court, A Taj Hotel, London",8.7,3524,2596
3,3,Bayswater by CAPITAL,6.9,108,1454
4,4,Nobu Hotel London Portman Square,8.5,865,5336

In [77]:
booking.to_sql('booking_com', conn, if_exists='append', index = False)

25